Целочисленное деление и остаток. Методы работы со строками. Решение задач 5, 12 и 14.
# Работа со строками и числами

## Целочисленное деление и остаток

В Python целочисленное деление обозначается оператором `//`, а остаток от деления - оператором `%`. Эти операторы полезны при работе с числами, особенно в задачах, связанных с делением и разделением на группы.

Примеры:

```python
result = 10 // 3  # Результат: 3
remainder = 10 % 3  # Результат: 1
```

## Методы работы со строками

Python предоставляет множество методов для работы со строками, которые облегчают их обработку и манипулирование. Ниже приведены некоторые из наиболее распространенных методов:

### Методы для изменения регистра

- `upper()`: Преобразует все символы строки в верхний регистр.
- `lower()`: Преобразует все символы строки в нижний регистр.
- `capitalize()`: Преобразует первый символ строки в верхний регистр, а все остальные - в нижний.

### Методы для поиска и замены

- `find(substring)`: Возвращает индекс первого вхождения подстроки в строку. Если подстрока не найдена, возвращает -1.
- `replace(old, new)`: Заменяет все вхождения подстроки `old` на подстроку `new`.
- `count(substring)`: Возвращает количество вхождений подстроки в строку.

### Методы для разделения и объединения

- `split(separator)`: Разделяет строку на список подстрок по заданному разделителю.
- `join(iterable)`: Объединяет элементы итерируемого объекта в строку, используя текущую строку в качестве разделителя.

### Пример 1: Поиск подстроки в строке

```python
sentence = "Python is a powerful programming language"
substring = "powerful"
if substring in sentence:
    print("Подстрока найдена в строке.")
else:
    print("Подстрока не найдена в строке.")
```

### Пример 2: Замена подстроки в строке

```python
sentence = "I like bananas"
new_sentence = sentence.replace("bananas", "apples")
print("Старое предложение:", sentence)
print("Новое предложение:", new_sentence)
```

### Пример 3: Разделение строки на подстроки

```python
names = "John,Emma,James,Lisa"
name_list = names.split(",")
print("Список имён:", name_list)
```

### Пример 4: Объединение подстрок в строку

```python
words = ["Hello", "world", "!"]
sentence = " ".join(words)
print("Полученное предложение:", sentence)
```

### Пример 5: Преобразование регистра символов

```python
text = "Hello, World!"
print("Верхний регистр:", text.upper())
print("Нижний регистр:", text.lower())
print("Каждое слово с заглавной буквы:", text.title())
```

### Пример 6: Форматирование строк

```python
name = "Alice"
age = 25
print("Привет, меня зовут {}, и мне {} лет.".format(name, age))
```

### Пример 7: Подсчет символов в строке

```python
sentence = "Python programming"
print("Количество символов в строке:", len(sentence))
```

### Пример 8: Проверка типа символов

```python
string = "12345"
if string.isdigit():
    print("Строка состоит только из цифр.")
else:
    print("Строка содержит не только цифры.")
```

## Решение задач

### Задача 5

_Условия задачи:_

Исполнитель Шифратор получает на вход число N и выводит число R, которое он вычисляет следующим образом:

1. Записывает N в двоичной системе счисления.

2. Обрабатывает эту запись:

а) если число N делится на 3, то Шифратор к этой записи дописывает справа три последние двоичные цифры;

б) иначе Шифратор умножает остаток от деления на 3, переводит в двоичную запись и дописывает в конец числа.

3. Получившееся число Шифратор переводит в десятичную систему счисления и выводит.

Например, для исходного числа 12 = 11002 результатом является число 11001002 = 100, а для исходного числа 4 = 1002 результатом является число 100112 = 19.

Укажите максимальное число R, не превышающее 170, которое может вывести Шифратор.

_Решение:_

_Код на_ _Python:_
```python
max_r = 0
for n in range(1, 300):
    b = bin(n)[2:]
    if n % 3 == 0:
        b = b + b[-3:]
    else:
        b = b + bin(3 * (n % 3))[2:]
    r = int(b, 2)
    if r <= 170:
        max_r = max(max_r, r)
print(max_r)
```
_Ответ_: 166.
### Задача 12

_Условия задачи:_

Дана программа для исполнителя Редактора:

НАЧАЛО
ПОКА нашлось(44444) ИЛИ нашлось(333)
   ЕСЛИ нашлось(44444)
      ТО заменить(44444, 3)
      ИНАЧЕ заменить(333, 4)
   КОНЕЦ ЕСЛИ
КОНЕЦ ПОКА
КОНЕЦ

Какая строка получится, если на вход этой программы подать строку, состоящую из 104 идущих подряд цифр 3?

_Решение:_

_Код на_ _Python:_
```python
string = "3" * 104
while "44444" in string or "333" in string:
    if "44444" in string:
        string = string.replace("44444", "3", 1)
    else:
        string = string.replace("333", "4", 1)
print(string)

```
_Ответ_: 33.
### Задача 14

_Условия задачи:_

В следующем выражении используется 19-ричная система счисления:

98897x2119 + 2x92319

Определите наибольшее значение x, при котором значение данного арифметического выражения кратно 18.

Укажите в ответе частное от деления значения выражения на 18 и укажите его в десятичной системе счисления.

_Решение__:_

_Код_ _на_ _Python:_
```python
results = set()
alphabet = '0123456789ABCDEFGHI'
for x in alphabet:
    f = int(f'98897{x}21', 19) + int(f'2{x}923', 19)
    if f % 18 == 0:
        results.add(f // 18)
print(max(results))
```
_Ответ_: 469034148.