Открытие текстового файла в Python. Построчное чтение текстового файла. Закрытие файла. Решение задачи 17.

### Чтение файлов в Python

Чтение файлов - это одна из основных операций при работе с файловой системой в Python. В этом разделе мы рассмотрим основные способы открытия и чтения текстовых файлов в Python.

### Открытие текстового файла в Python

Для открытия файла в Python используется функция `open()`. Эта функция принимает два основных аргумента: путь к файлу и режим доступа.

```python
file = open("filename.txt", "r")
```

Аргументы режима доступа могут включать:

- `"r"`: чтение (по умолчанию).
- `"w"`: запись (если файл не существует, он будет создан; если существует, его содержимое будет заменено).
- `"a"`: добавление (добавление данных в конец файла).
- `"b"`: бинарный режим (для работы с бинарными файлами).
- `"t"`: текстовый режим (по умолчанию).
- `"+"`: обновление (чтение и запись).

### Построчное чтение текстового файла

После открытия файла его содержимое можно прочитать с помощью различных методов. Один из наиболее распространенных способов - построчное чтение файла с использованием цикла.

```python
file = open("filename.txt", "r")
for line in file:
    print(line)
file.close()
```

Этот код поочередно выводит каждую строку файла.

### Закрытие файла

После чтения файла важно закрыть его с помощью метода `close()`. Это освободит ресурсы, связанные с файлом, и предотвратит утечку памяти.

```python
file.close()
```

### Работа с файлом с помощью `with`

Чтобы гарантировать автоматическое закрытие файла после работы с ним, рекомендуется использовать конструкцию `with`. Это помогает не забыть закрыть файл и упрощает код.

```python
with open("filename.txt", "r") as file:
    for line in file:
        print(line)
```

После завершения блока `with` файл автоматически закрывается, даже если происходит исключение во время выполнения кода внутри блока.

### Примеры использования

Рассмотрим несколько примеров использования чтения файлов в Python:

1. **Подсчет строк в файле:**

```python
with open("filename.txt", "r") as file:
    line_count = sum(1 for line in file)
    print("Number of lines:", line_count)
```

2. **Поиск определенного текста в файле:**

```python
search_term = "Python"
with open("filename.txt", "r") as file:
    for line in file:
        if search_term in line:
            print("Found:", line)
```

3. **Чтение файла в список строк:**

```python
with open("filename.txt", "r") as file:
    lines = file.readlines()
    print(lines)
```

### Решение задачи 17
##### Условия задачи:
В файле содержится набор чисел, из которых можно составлять тройки. Определите количество троек, в которых ровно два из трёх элементов - трехзначные, а сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 17.

В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек.
##### Решение:
Код на Python:
``` python
f = open('17.txt')
numbers = [int(x) for x in f]
max_s = max([number for number in numbers if number % 100 == 17])
count = 0
trios = []
trio = []
for i in range(len(numbers) - 2):
    trio = sorted([numbers[i],numbers[i + 1],numbers[i + 2]])
    if trio.count(100 <= x <= 999) == 2 and sum(trio) <= max_s:
    trios.append(sum(trio))
print(len(trios),max(trios))
```
Ответ: 959 97473.
